### Imports

In [1]:
import sys
sys.path.append('../')

from wavy import *
import pandas as pd

### Load data

In [2]:
data_pd = pd.read_pickle('processed.pkl')
data_pd = data_pd.iloc[0:2,:]
data_pd = data_pd.loc[:, (['MSFT', 'AAPL'], ['Open', 'Close'])]
data_pd

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

### DataBlock from single level DataFrame

In [3]:
data = data_pd.loc[:, 'AAPL']
data

                Open     Close
Date
2005-12-21  2.218566  2.246069
2005-12-22  2.258598  2.261960

In [4]:
datablock = from_dataframe(data, 'AAPL')
datablock

                AAPL
                Open     Close
Date
2005-12-21  2.218566  2.246069
2005-12-22  2.258598  2.261960

In [5]:
type(datablock)

wavy.block.TimeBlock

### DataBlock from multi level DataFrame

In [6]:
datablock = from_dataframe(data_pd)
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [7]:
datablock.index

DatetimeIndex(['2005-12-21', '2005-12-22'], dtype='datetime64[ns]', name='Date', freq=None)

In [8]:
datablock.shape

(2, 4)

### Function `filter`

In [9]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [10]:
datablock.filter(assets=['AAPL'], channels=['Open'])

                AAPL
                Open
Date
2005-12-21  2.218566
2005-12-22  2.258598

### Function `drop`

In [11]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [12]:
datablock.drop(assets=['AAPL'], channels=['Open'])

                 MSFT
                Close
Date
2005-12-21  19.475122
2005-12-22  19.373114

### Comparison between `add_level` and `new_add_level`

The old function `add_level` seems wrong, it is adding asset above Date, new function proposed.

In [13]:
level = data.loc[:, 'AAPL']
level = pd.concat({'level_0': level.T}, names=['level_0']).T
level

level_0      level_0
                Open     Close
Date
2005-12-21  2.218566  2.246069
2005-12-22  2.258598  2.261960

In [14]:
new_level = data.loc[:, 'AAPL']
new_level.columns = pd.MultiIndex.from_product([['level_0'], new_level.columns])
new_level

             level_0
                Open     Close
Date
2005-12-21  2.218566  2.246069
2005-12-22  2.258598  2.261960

### Rename assets

In [15]:
datablock
dict = {'AAPL': 'Apple', 'MSFT': 'Microsoft'}
datablock.rename_assets(dict)

            Microsoft                Apple
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

### Rename channels

In [16]:
datablock
dict = {'Open': 'Op', 'Close': 'Cl'}
datablock.rename_channels(dict)

                 MSFT                 AAPL
                   Op         Cl        Op        Cl
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

### Function `update`

In [17]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [18]:
datablock.update(values = datablock.matrix, assets=['Microsoft', 'Apple'], channels=['Op', 'Cl'])

            Microsoft                Apple
                   Op         Cl        Op        Cl
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [19]:
datablock.update(values = datablock.tensor, assets=['Microsoft', 'Apple'], channels=['Op', 'Cl'])

            Microsoft                Apple
                   Op         Cl        Op        Cl
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

### Function apply

In [20]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [21]:
datablock.apply(np.max, on='channels')

                 MSFT      AAPL
                 amax      amax
Date
2005-12-21  19.577126  2.246069
2005-12-22  19.460543  2.261960

### Function `swap_cols`

In [22]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [23]:
datablock.swap_cols()

                 Open                Close
                 MSFT      AAPL       MSFT      AAPL
Date
2005-12-21  19.577126  2.218566  19.475122  2.246069
2005-12-22  19.460543  2.258598  19.373114  2.261960

### Function `sort_assets`

In [24]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [25]:
datablock.sort_assets()

                AAPL                 MSFT
                Open     Close       Open      Close
Date
2005-12-21  2.218566  2.246069  19.577126  19.475122
2005-12-22  2.258598  2.261960  19.460543  19.373114

### Function `sort_channels`

In [26]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [27]:
datablock.sort_channels()

                 MSFT                 AAPL
                Close       Open     Close      Open
Date
2005-12-21  19.475122  19.577126  2.246069  2.218566
2005-12-22  19.373114  19.460543  2.261960  2.258598

### Function `countna`

In [28]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  2.218566  2.246069
2005-12-22  19.460543  19.373114  2.258598  2.261960

In [29]:
datablock.matrix[0][2] = np.nan
datablock.matrix[1][1] = np.nan
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122       NaN  2.246069
2005-12-22  19.460543        NaN  2.258598  2.261960

In [30]:
datablock['MSFT'].dropna()

                 Open      Close
Date
2005-12-21  19.577126  19.475122

In [31]:
s = pd.Series(dtype=int)
for asset in datablock.assets:
    # s[asset] = len(datablock[asset]) - len(datablock[asset].dropna())
    print(len(datablock[asset].dropna()))

1
1

In [32]:
datablock.countna('asset')

MSFT    1
AAPL    1
dtype: int64

In [33]:
datablock.countna('channel')

MSFT  Open     0
      Close    1
AAPL  Open     1
      Close    0
dtype: int64

### Function `fillna`

In [34]:
datablock

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122       NaN  2.246069
2005-12-22  19.460543        NaN  2.258598  2.261960

In [35]:
datablock.fillna(0)

/Users/ibiscp/GitHub/wavy/notebooks/../wavy/block.py:883: FutureWarning: In a future version of pandas all arguments of DataFrame.fillna except for the argument 'value' will be keyword-only
  return super().fillna(value, method)

                 MSFT                 AAPL
                 Open      Close      Open     Close
Date
2005-12-21  19.577126  19.475122  0.000000  2.246069
2005-12-22  19.460543   0.000000  2.258598  2.261960

### Function `split_assets`

In [ ]:
datablock

In [ ]:
datablock.split_assets()

### Function `from_dataframes`

#### From a `dict`

In [ ]:
AAPL = data_pd.loc[:, 'AAPL']
MSFT = data_pd.loc[:, 'MSFT']

dict = {'AAPL': AAPL, 'MSFT': MSFT}
dict

In [ ]:
from_dict(dict)

#### From a `data`

In [ ]:
aapl = data_pd.loc[:, 'AAPL']
aapl

In [ ]:
msft = data_pd.loc[:, 'MSFT']
msft

In [ ]:
from_dataframes([aapl, msft])

#### From `data`, `assets`

In [ ]:
aapl = data_pd.loc[:, 'AAPL']
aapl

In [ ]:
msft = data_pd.loc[:, 'MSFT']
msft

In [ ]:
from_dataframes([aapl, msft], ['AAPL', 'MSFT'])

### Try `from_dataframes` with multilevel

In [ ]:
AAPL = data_pd.loc[:, 'AAPL']
AAPL.columns = pd.MultiIndex.from_product([['level_0'], AAPL.columns])
MSFT = data_pd.loc[:, 'MSFT']

try:
    datablock = from_dataframes([AAPL, MSFT], ['AAPL', 'MSFT'])
except Exception as e:
    print(e)

### Try `from_dataframes` with not a DataFrame

In [ ]:
AAPL = data_pd.loc[:, 'AAPL']

try:
    datablock = from_dataframes([AAPL, 1], ['AAPL', 'MSFT'])
except Exception as e:
    print(e)

### Try `from_dataframes` with different number of channels

In [ ]:
AAPL = data_pd.loc[:, 'AAPL'].copy()
AAPL.drop('Close', axis=1, inplace=True)
MSFT = data_pd.loc[:, 'MSFT']

try:
    datablock = from_dataframes([AAPL, MSFT], ['AAPL', 'MSFT'])
except Exception as e:
    print(e)

### Error using DataFrame instead of DataBlock

In [ ]:
print(type(data_pd))
simp_data = data_pd.iloc[:, 0:4]
print(id(data_pd))
print(id(simp_data))
assets = simp_data.columns.levels[0]
assets

In [ ]:
print(type(datablock))
# simp_datablock = datablock.iloc[:, 0:4]
# datablock.columns.levels[0]
simp_datablock.columns.levels[0]
print(id(datablock))
print(id(simp_datablock))
assets = simp_datablock.columns.levels[0]
assets

In [ ]:
datablock.assets

### Function `from_matrix`

In [ ]:
values = datablock.values
index = datablock.index
assets = datablock.assets
channels = datablock.channels

In [ ]:
values

In [ ]:
index

In [ ]:
assets

In [ ]:
from_matrix(values, index=index, assets=assets, channels=channels)

### Function `from_tensor`

In [ ]:
simp_datablock = datablock.iloc[:, 0:10]
index = list(simp_datablock.index)
assets = list(simp_datablock.assets)
channels = list(simp_datablock.channels)
values = list(np.array([simp_datablock.iloc[:, i*2:i*2+2].values for i in range(2)]))

In [ ]:
values

In [ ]:
index

In [ ]:
assets

In [ ]:
from_tensor(values, index=index, assets=assets, channels=channels)

### Function as_dataframe

In [ ]:
type(datablock)

In [ ]:
type(datablock.as_dataframe())

# Properties
### matrix

In [ ]:
datablock

In [ ]:
datablock.matrix

### tensor

In [ ]:
datablock

In [ ]:
datablock.tensor

### Channels

In [ ]:
datablock.channels

### Assets

In [ ]:
datablock.assets

In [ ]:
datablock.start

In [ ]:
datablock.end

## Error test

In [ ]:
data_pd = pd.read_pickle('processed.pkl')

datablock = from_dataframe(data_pd)
datablock

In [ ]:
new_db = datablock.filter(assets=['AAPL', 'MSFT'])

In [ ]:
new_db.columns